grevaillot/svd_tools/headers/STM32H750x/otg2_hs_device.h
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL2_TXFNUM_SHIFT		22
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL2_TXFNUM_MASK		0x0f
/** @defgroup otg2_hs_device_otg_hs_diepctl2_txfnum TXFNUM TxFIFO number
@{*/
/**@}*/

/** OTG2_HS_DEVICE_OTG_HS_DIEPCTL2_Stall STALL handshake **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL2_Stall		(1 << 21)

#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL2_EPTYP_SHIFT		18
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL2_EPTYP_MASK		0x03
/** @defgroup otg2_hs_device_otg_hs_diepctl2_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG2_HS_DEVICE_OTG_HS_DIEPCTL2_NAKSTS NAK status **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL2_NAKSTS		(1 << 17)
/** OTG2_HS_DEVICE_OTG_HS_DIEPCTL2_EONUM_DPID Even/odd frame **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL2_EONUM_DPID		(1 << 16)
/** OTG2_HS_DEVICE_OTG_HS_DIEPCTL2_USBAEP USB active endpoint **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL2_USBAEP		(1 << 15)

#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL2_MPSIZ_SHIFT		0
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL2_MPSIZ_MASK		0x7ff
/** @defgroup otg2_hs_device_otg_hs_diepctl2_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg2_hs_device_otg_hs_diepint2 OTGHSDIEPINT2 OTG device endpoint-2 interrupt register
@{*/

/** OTG2_HS_DEVICE_OTG_HS_DIEPINT2_NAK NAK interrupt **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPINT2_NAK		(1 << 13)
/** OTG2_HS_DEVICE_OTG_HS_DIEPINT2_BERR Babble error interrupt **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPINT2_BERR		(1 << 12)
/** OTG2_HS_DEVICE_OTG_HS_DIEPINT2_PKTDRPSTS Packet dropped status **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPINT2_PKTDRPSTS		(1 << 11)
/** OTG2_HS_DEVICE_OTG_HS_DIEPINT2_BNA Buffer not available interrupt **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPINT2_BNA		(1 << 9)
/** OTG2_HS_DEVICE_OTG_HS_DIEPINT2_TXFIFOUDRN Transmit Fifo Underrun **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPINT2_TXFIFOUDRN		(1 << 8)
/** OTG2_HS_DEVICE_OTG_HS_DIEPINT2_TXFE Transmit FIFO empty **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPINT2_TXFE		(1 << 7)
/** OTG2_HS_DEVICE_OTG_HS_DIEPINT2_INEPNE IN endpoint NAK effective **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPINT2_INEPNE		(1 << 6)
/** OTG2_HS_DEVICE_OTG_HS_DIEPINT2_ITTXFE IN token received when TxFIFO is empty **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPINT2_ITTXFE		(1 << 4)
/** OTG2_HS_DEVICE_OTG_HS_DIEPINT2_TOC Timeout condition **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPINT2_TOC		(1 << 3)
/** OTG2_HS_DEVICE_OTG_HS_DIEPINT2_EPDISD Endpoint disabled interrupt **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPINT2_EPDISD		(1 << 1)
/** OTG2_HS_DEVICE_OTG_HS_DIEPINT2_XFRC Transfer completed interrupt **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPINT2_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg2_hs_device_otg_hs_dieptsiz2 OTGHSDIEPTSIZ2 OTG_HS device endpoint transfer size register
@{*/


#define OTG2_HS_DEVICE_OTG_HS_DIEPTSIZ2_MCNT_SHIFT		29
#define OTG2_HS_DEVICE_OTG_HS_DIEPTSIZ2_MCNT_MASK		0x03
/** @defgroup otg2_hs_device_otg_hs_dieptsiz2_mcnt MCNT Multi count
@{*/
/**@}*/


#define OTG2_HS_DEVICE_OTG_HS_DIEPTSIZ2_PKTCNT_SHIFT		19
#define OTG2_HS_DEVICE_OTG_HS_DIEPTSIZ2_PKTCNT_MASK		0x3ff
/** @defgroup otg2_hs_device_otg_hs_dieptsiz2_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG2_HS_DEVICE_OTG_HS_DIEPTSIZ2_XFRSIZ_SHIFT		0
#define OTG2_HS_DEVICE_OTG_HS_DIEPTSIZ2_XFRSIZ_MASK		0x7ffff
/** @defgroup otg2_hs_device_otg_hs_dieptsiz2_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg2_hs_device_otg_hs_diepdma3 OTGHSDIEPDMA3 OTG_HS device endpoint-3 DMA address register
@{*/


#define OTG2_HS_DEVICE_OTG_HS_DIEPDMA3_DMAADDR_SHIFT		0
#define OTG2_HS_DEVICE_OTG_HS_DIEPDMA3_DMAADDR_MASK		0xffffffff
/** @defgroup otg2_hs_device_otg_hs_diepdma3_dmaaddr DMAADDR DMA address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg2_hs_device_otg_hs_dtxfsts2 OTGHSDTXFSTS2 OTG_HS device IN endpoint transmit FIFO status register
@{*/


#define OTG2_HS_DEVICE_OTG_HS_DTXFSTS2_INEPTFSAV_SHIFT		0
#define OTG2_HS_DEVICE_OTG_HS_DTXFSTS2_INEPTFSAV_MASK		0xffff
/** @defgroup otg2_hs_device_otg_hs_dtxfsts2_ineptfsav INEPTFSAV IN endpoint TxFIFO space avail
@{*/
/**@}*/


/**@}*/

/** @defgroup otg2_hs_device_otg_hs_diepctl3 OTGHSDIEPCTL3 OTG device endpoint-3 control register
@{*/

/** OTG2_HS_DEVICE_OTG_HS_DIEPCTL3_EPENA Endpoint enable **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL3_EPENA		(1 << 31)
/** OTG2_HS_DEVICE_OTG_HS_DIEPCTL3_EPDIS Endpoint disable **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL3_EPDIS		(1 << 30)
/** OTG2_HS_DEVICE_OTG_HS_DIEPCTL3_SODDFRM Set odd frame **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL3_SODDFRM		(1 << 29)
/** OTG2_HS_DEVICE_OTG_HS_DIEPCTL3_SD0PID_SEVNFRM Set DATA0 PID **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL3_SD0PID_SEVNFRM		(1 << 28)
/** OTG2_HS_DEVICE_OTG_HS_DIEPCTL3_SNAK Set NAK **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL3_SNAK		(1 << 27)
/** OTG2_HS_DEVICE_OTG_HS_DIEPCTL3_CNAK Clear NAK **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL3_CNAK		(1 << 26)

#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL3_TXFNUM_SHIFT		22
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL3_TXFNUM_MASK		0x0f
/** @defgroup otg2_hs_device_otg_hs_diepctl3_txfnum TXFNUM TxFIFO number
@{*/
/**@}*/

/** OTG2_HS_DEVICE_OTG_HS_DIEPCTL3_Stall STALL handshake **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL3_Stall		(1 << 21)

#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL3_EPTYP_SHIFT		18
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL3_EPTYP_MASK		0x03
/** @defgroup otg2_hs_device_otg_hs_diepctl3_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG2_HS_DEVICE_OTG_HS_DIEPCTL3_NAKSTS NAK status **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL3_NAKSTS		(1 << 17)
/** OTG2_HS_DEVICE_OTG_HS_DIEPCTL3_EONUM_DPID Even/odd frame **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL3_EONUM_DPID		(1 << 16)
/** OTG2_HS_DEVICE_OTG_HS_DIEPCTL3_USBAEP USB active endpoint **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL3_USBAEP		(1 << 15)

#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL3_MPSIZ_SHIFT		0
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL3_MPSIZ_MASK		0x7ff
/** @defgroup otg2_hs_device_otg_hs_diepctl3_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg2_hs_device_otg_hs_diepint3 OTGHSDIEPINT3 OTG device endpoint-3 interrupt register
@{*/

