grevaillot/svd_tools/headers/STM32H750x/otg2_hs_device.h
#define OTG2_HS_DEVICE_OTG_HS_DIEPTSIZ4_MCNT_SHIFT		29
#define OTG2_HS_DEVICE_OTG_HS_DIEPTSIZ4_MCNT_MASK		0x03
/** @defgroup otg2_hs_device_otg_hs_dieptsiz4_mcnt MCNT Multi count
@{*/
/**@}*/


#define OTG2_HS_DEVICE_OTG_HS_DIEPTSIZ4_PKTCNT_SHIFT		19
#define OTG2_HS_DEVICE_OTG_HS_DIEPTSIZ4_PKTCNT_MASK		0x3ff
/** @defgroup otg2_hs_device_otg_hs_dieptsiz4_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG2_HS_DEVICE_OTG_HS_DIEPTSIZ4_XFRSIZ_SHIFT		0
#define OTG2_HS_DEVICE_OTG_HS_DIEPTSIZ4_XFRSIZ_MASK		0x7ffff
/** @defgroup otg2_hs_device_otg_hs_dieptsiz4_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg2_hs_device_otg_hs_diepdma5 OTGHSDIEPDMA5 OTG_HS device endpoint-5 DMA address register
@{*/


#define OTG2_HS_DEVICE_OTG_HS_DIEPDMA5_DMAADDR_SHIFT		0
#define OTG2_HS_DEVICE_OTG_HS_DIEPDMA5_DMAADDR_MASK		0xffffffff
/** @defgroup otg2_hs_device_otg_hs_diepdma5_dmaaddr DMAADDR DMA address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg2_hs_device_otg_hs_dtxfsts4 OTGHSDTXFSTS4 OTG_HS device IN endpoint transmit FIFO status register
@{*/


#define OTG2_HS_DEVICE_OTG_HS_DTXFSTS4_INEPTFSAV_SHIFT		0
#define OTG2_HS_DEVICE_OTG_HS_DTXFSTS4_INEPTFSAV_MASK		0xffff
/** @defgroup otg2_hs_device_otg_hs_dtxfsts4_ineptfsav INEPTFSAV IN endpoint TxFIFO space avail
@{*/
/**@}*/


/**@}*/

/** @defgroup otg2_hs_device_otg_hs_diepctl5 OTGHSDIEPCTL5 OTG device endpoint-5 control register
@{*/

/** OTG2_HS_DEVICE_OTG_HS_DIEPCTL5_EPENA Endpoint enable **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL5_EPENA		(1 << 31)
/** OTG2_HS_DEVICE_OTG_HS_DIEPCTL5_EPDIS Endpoint disable **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL5_EPDIS		(1 << 30)
/** OTG2_HS_DEVICE_OTG_HS_DIEPCTL5_SODDFRM Set odd frame **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL5_SODDFRM		(1 << 29)
/** OTG2_HS_DEVICE_OTG_HS_DIEPCTL5_SD0PID_SEVNFRM Set DATA0 PID **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL5_SD0PID_SEVNFRM		(1 << 28)
/** OTG2_HS_DEVICE_OTG_HS_DIEPCTL5_SNAK Set NAK **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL5_SNAK		(1 << 27)
/** OTG2_HS_DEVICE_OTG_HS_DIEPCTL5_CNAK Clear NAK **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL5_CNAK		(1 << 26)

#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL5_TXFNUM_SHIFT		22
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL5_TXFNUM_MASK		0x0f
/** @defgroup otg2_hs_device_otg_hs_diepctl5_txfnum TXFNUM TxFIFO number
@{*/
/**@}*/

/** OTG2_HS_DEVICE_OTG_HS_DIEPCTL5_Stall STALL handshake **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL5_Stall		(1 << 21)

#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL5_EPTYP_SHIFT		18
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL5_EPTYP_MASK		0x03
/** @defgroup otg2_hs_device_otg_hs_diepctl5_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG2_HS_DEVICE_OTG_HS_DIEPCTL5_NAKSTS NAK status **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL5_NAKSTS		(1 << 17)
/** OTG2_HS_DEVICE_OTG_HS_DIEPCTL5_EONUM_DPID Even/odd frame **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL5_EONUM_DPID		(1 << 16)
/** OTG2_HS_DEVICE_OTG_HS_DIEPCTL5_USBAEP USB active endpoint **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL5_USBAEP		(1 << 15)

#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL5_MPSIZ_SHIFT		0
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL5_MPSIZ_MASK		0x7ff
/** @defgroup otg2_hs_device_otg_hs_diepctl5_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg2_hs_device_otg_hs_dieptsiz6 OTGHSDIEPTSIZ6 OTG_HS device endpoint transfer size register
@{*/


#define OTG2_HS_DEVICE_OTG_HS_DIEPTSIZ6_MCNT_SHIFT		29
#define OTG2_HS_DEVICE_OTG_HS_DIEPTSIZ6_MCNT_MASK		0x03
/** @defgroup otg2_hs_device_otg_hs_dieptsiz6_mcnt MCNT Multi count
@{*/
/**@}*/


#define OTG2_HS_DEVICE_OTG_HS_DIEPTSIZ6_PKTCNT_SHIFT		19
#define OTG2_HS_DEVICE_OTG_HS_DIEPTSIZ6_PKTCNT_MASK		0x3ff
/** @defgroup otg2_hs_device_otg_hs_dieptsiz6_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG2_HS_DEVICE_OTG_HS_DIEPTSIZ6_XFRSIZ_SHIFT		0
#define OTG2_HS_DEVICE_OTG_HS_DIEPTSIZ6_XFRSIZ_MASK		0x7ffff
/** @defgroup otg2_hs_device_otg_hs_dieptsiz6_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg2_hs_device_otg_hs_dtxfsts6 OTGHSDTXFSTS6 OTG_HS device IN endpoint transmit FIFO status register
@{*/


#define OTG2_HS_DEVICE_OTG_HS_DTXFSTS6_INEPTFSAV_SHIFT		0
#define OTG2_HS_DEVICE_OTG_HS_DTXFSTS6_INEPTFSAV_MASK		0xffff
/** @defgroup otg2_hs_device_otg_hs_dtxfsts6_ineptfsav INEPTFSAV IN endpoint TxFIFO space avail
@{*/
/**@}*/


/**@}*/

/** @defgroup otg2_hs_device_otg_hs_diepint5 OTGHSDIEPINT5 OTG device endpoint-5 interrupt register
@{*/

/** OTG2_HS_DEVICE_OTG_HS_DIEPINT5_NAK NAK interrupt **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPINT5_NAK		(1 << 13)
/** OTG2_HS_DEVICE_OTG_HS_DIEPINT5_BERR Babble error interrupt **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPINT5_BERR		(1 << 12)
/** OTG2_HS_DEVICE_OTG_HS_DIEPINT5_PKTDRPSTS Packet dropped status **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPINT5_PKTDRPSTS		(1 << 11)
/** OTG2_HS_DEVICE_OTG_HS_DIEPINT5_BNA Buffer not available interrupt **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPINT5_BNA		(1 << 9)
/** OTG2_HS_DEVICE_OTG_HS_DIEPINT5_TXFIFOUDRN Transmit Fifo Underrun **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPINT5_TXFIFOUDRN		(1 << 8)
/** OTG2_HS_DEVICE_OTG_HS_DIEPINT5_TXFE Transmit FIFO empty **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPINT5_TXFE		(1 << 7)
/** OTG2_HS_DEVICE_OTG_HS_DIEPINT5_INEPNE IN endpoint NAK effective **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPINT5_INEPNE		(1 << 6)
/** OTG2_HS_DEVICE_OTG_HS_DIEPINT5_ITTXFE IN token received when TxFIFO is empty **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPINT5_ITTXFE		(1 << 4)
/** OTG2_HS_DEVICE_OTG_HS_DIEPINT5_TOC Timeout condition **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPINT5_TOC		(1 << 3)
/** OTG2_HS_DEVICE_OTG_HS_DIEPINT5_EPDISD Endpoint disabled interrupt **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPINT5_EPDISD		(1 << 1)
/** OTG2_HS_DEVICE_OTG_HS_DIEPINT5_XFRC Transfer completed interrupt **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPINT5_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg2_hs_device_otg_hs_dieptsiz7 OTGHSDIEPTSIZ7 OTG_HS device endpoint transfer size register
@{*/


#define OTG2_HS_DEVICE_OTG_HS_DIEPTSIZ7_MCNT_SHIFT		29
#define OTG2_HS_DEVICE_OTG_HS_DIEPTSIZ7_MCNT_MASK		0x03
/** @defgroup otg2_hs_device_otg_hs_dieptsiz7_mcnt MCNT Multi count
@{*/
/**@}*/


#define OTG2_HS_DEVICE_OTG_HS_DIEPTSIZ7_PKTCNT_SHIFT		19
#define OTG2_HS_DEVICE_OTG_HS_DIEPTSIZ7_PKTCNT_MASK		0x3ff
/** @defgroup otg2_hs_device_otg_hs_dieptsiz7_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG2_HS_DEVICE_OTG_HS_DIEPTSIZ7_XFRSIZ_SHIFT		0
#define OTG2_HS_DEVICE_OTG_HS_DIEPTSIZ7_XFRSIZ_MASK		0x7ffff
/** @defgroup otg2_hs_device_otg_hs_dieptsiz7_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg2_hs_device_otg_hs_dtxfsts7 OTGHSDTXFSTS7 OTG_HS device IN endpoint transmit FIFO status register
@{*/


#define OTG2_HS_DEVICE_OTG_HS_DTXFSTS7_INEPTFSAV_SHIFT		0
#define OTG2_HS_DEVICE_OTG_HS_DTXFSTS7_INEPTFSAV_MASK		0xffff
/** @defgroup otg2_hs_device_otg_hs_dtxfsts7_ineptfsav INEPTFSAV IN endpoint TxFIFO space avail
@{*/
/**@}*/


/**@}*/

