grevaillot/svd_tools/headers/STM32H750x/otg2_hs_device.h
/** @defgroup otg2_hs_device_otg_hs_dieptsiz5 OTGHSDIEPTSIZ5 OTG_HS device endpoint transfer size register
@{*/


#define OTG2_HS_DEVICE_OTG_HS_DIEPTSIZ5_MCNT_SHIFT		29
#define OTG2_HS_DEVICE_OTG_HS_DIEPTSIZ5_MCNT_MASK		0x03
/** @defgroup otg2_hs_device_otg_hs_dieptsiz5_mcnt MCNT Multi count
@{*/
/**@}*/


#define OTG2_HS_DEVICE_OTG_HS_DIEPTSIZ5_PKTCNT_SHIFT		19
#define OTG2_HS_DEVICE_OTG_HS_DIEPTSIZ5_PKTCNT_MASK		0x3ff
/** @defgroup otg2_hs_device_otg_hs_dieptsiz5_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG2_HS_DEVICE_OTG_HS_DIEPTSIZ5_XFRSIZ_SHIFT		0
#define OTG2_HS_DEVICE_OTG_HS_DIEPTSIZ5_XFRSIZ_MASK		0x7ffff
/** @defgroup otg2_hs_device_otg_hs_dieptsiz5_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg2_hs_device_otg_hs_dtxfsts5 OTGHSDTXFSTS5 OTG_HS device IN endpoint transmit FIFO status register
@{*/


#define OTG2_HS_DEVICE_OTG_HS_DTXFSTS5_INEPTFSAV_SHIFT		0
#define OTG2_HS_DEVICE_OTG_HS_DTXFSTS5_INEPTFSAV_MASK		0xffff
/** @defgroup otg2_hs_device_otg_hs_dtxfsts5_ineptfsav INEPTFSAV IN endpoint TxFIFO space avail
@{*/
/**@}*/


/**@}*/

/** @defgroup otg2_hs_device_otg_hs_diepctl6 OTGHSDIEPCTL6 OTG device endpoint-6 control register
@{*/

/** OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_EPENA Endpoint enable **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_EPENA		(1 << 31)
/** OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_EPDIS Endpoint disable **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_EPDIS		(1 << 30)
/** OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_SODDFRM Set odd frame **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_SODDFRM		(1 << 29)
/** OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_SD0PID_SEVNFRM Set DATA0 PID **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_SD0PID_SEVNFRM		(1 << 28)
/** OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_SNAK Set NAK **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_SNAK		(1 << 27)
/** OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_CNAK Clear NAK **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_CNAK		(1 << 26)

#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_TXFNUM_SHIFT		22
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_TXFNUM_MASK		0x0f
/** @defgroup otg2_hs_device_otg_hs_diepctl6_txfnum TXFNUM TxFIFO number
@{*/
/**@}*/

/** OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_Stall STALL handshake **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_Stall		(1 << 21)

#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_EPTYP_SHIFT		18
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_EPTYP_MASK		0x03
/** @defgroup otg2_hs_device_otg_hs_diepctl6_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_NAKSTS NAK status **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_NAKSTS		(1 << 17)
/** OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_EONUM_DPID Even/odd frame **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_EONUM_DPID		(1 << 16)
/** OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_USBAEP USB active endpoint **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_USBAEP		(1 << 15)

#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_MPSIZ_SHIFT		0
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_MPSIZ_MASK		0x7ff
/** @defgroup otg2_hs_device_otg_hs_diepctl6_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg2_hs_device_otg_hs_diepint6 OTGHSDIEPINT6 OTG device endpoint-6 interrupt register
@{*/

/** OTG2_HS_DEVICE_OTG_HS_DIEPINT6_NAK NAK interrupt **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPINT6_NAK		(1 << 13)
/** OTG2_HS_DEVICE_OTG_HS_DIEPINT6_BERR Babble error interrupt **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPINT6_BERR		(1 << 12)
/** OTG2_HS_DEVICE_OTG_HS_DIEPINT6_PKTDRPSTS Packet dropped status **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPINT6_PKTDRPSTS		(1 << 11)
/** OTG2_HS_DEVICE_OTG_HS_DIEPINT6_BNA Buffer not available interrupt **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPINT6_BNA		(1 << 9)
/** OTG2_HS_DEVICE_OTG_HS_DIEPINT6_TXFIFOUDRN Transmit Fifo Underrun **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPINT6_TXFIFOUDRN		(1 << 8)
/** OTG2_HS_DEVICE_OTG_HS_DIEPINT6_TXFE Transmit FIFO empty **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPINT6_TXFE		(1 << 7)
/** OTG2_HS_DEVICE_OTG_HS_DIEPINT6_INEPNE IN endpoint NAK effective **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPINT6_INEPNE		(1 << 6)
/** OTG2_HS_DEVICE_OTG_HS_DIEPINT6_ITTXFE IN token received when TxFIFO is empty **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPINT6_ITTXFE		(1 << 4)
/** OTG2_HS_DEVICE_OTG_HS_DIEPINT6_TOC Timeout condition **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPINT6_TOC		(1 << 3)
/** OTG2_HS_DEVICE_OTG_HS_DIEPINT6_EPDISD Endpoint disabled interrupt **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPINT6_EPDISD		(1 << 1)
/** OTG2_HS_DEVICE_OTG_HS_DIEPINT6_XFRC Transfer completed interrupt **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPINT6_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg2_hs_device_otg_hs_diepctl7 OTGHSDIEPCTL7 OTG device endpoint-7 control register
@{*/

/** OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_EPENA Endpoint enable **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_EPENA		(1 << 31)
/** OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_EPDIS Endpoint disable **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_EPDIS		(1 << 30)
/** OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_SODDFRM Set odd frame **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_SODDFRM		(1 << 29)
/** OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_SD0PID_SEVNFRM Set DATA0 PID **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_SD0PID_SEVNFRM		(1 << 28)
/** OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_SNAK Set NAK **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_SNAK		(1 << 27)
/** OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_CNAK Clear NAK **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_CNAK		(1 << 26)

#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_TXFNUM_SHIFT		22
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_TXFNUM_MASK		0x0f
/** @defgroup otg2_hs_device_otg_hs_diepctl7_txfnum TXFNUM TxFIFO number
@{*/
/**@}*/

/** OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_Stall STALL handshake **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_Stall		(1 << 21)

#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_EPTYP_SHIFT		18
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_EPTYP_MASK		0x03
/** @defgroup otg2_hs_device_otg_hs_diepctl7_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_NAKSTS NAK status **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_NAKSTS		(1 << 17)
/** OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_EONUM_DPID Even/odd frame **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_EONUM_DPID		(1 << 16)
/** OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_USBAEP USB active endpoint **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_USBAEP		(1 << 15)

#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_MPSIZ_SHIFT		0
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_MPSIZ_MASK		0x7ff
/** @defgroup otg2_hs_device_otg_hs_diepctl7_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg2_hs_device_otg_hs_diepint7 OTGHSDIEPINT7 OTG device endpoint-7 interrupt register
@{*/

/** OTG2_HS_DEVICE_OTG_HS_DIEPINT7_NAK NAK interrupt **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPINT7_NAK		(1 << 13)
/** OTG2_HS_DEVICE_OTG_HS_DIEPINT7_BERR Babble error interrupt **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPINT7_BERR		(1 << 12)
/** OTG2_HS_DEVICE_OTG_HS_DIEPINT7_PKTDRPSTS Packet dropped status **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPINT7_PKTDRPSTS		(1 << 11)
/** OTG2_HS_DEVICE_OTG_HS_DIEPINT7_BNA Buffer not available interrupt **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPINT7_BNA		(1 << 9)
/** OTG2_HS_DEVICE_OTG_HS_DIEPINT7_TXFIFOUDRN Transmit Fifo Underrun **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPINT7_TXFIFOUDRN		(1 << 8)
/** OTG2_HS_DEVICE_OTG_HS_DIEPINT7_TXFE Transmit FIFO empty **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPINT7_TXFE		(1 << 7)
/** OTG2_HS_DEVICE_OTG_HS_DIEPINT7_INEPNE IN endpoint NAK effective **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPINT7_INEPNE		(1 << 6)
/** OTG2_HS_DEVICE_OTG_HS_DIEPINT7_ITTXFE IN token received when TxFIFO is empty **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPINT7_ITTXFE		(1 << 4)
/** OTG2_HS_DEVICE_OTG_HS_DIEPINT7_TOC Timeout condition **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPINT7_TOC		(1 << 3)
/** OTG2_HS_DEVICE_OTG_HS_DIEPINT7_EPDISD Endpoint disabled interrupt **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPINT7_EPDISD		(1 << 1)
/** OTG2_HS_DEVICE_OTG_HS_DIEPINT7_XFRC Transfer completed interrupt **/
#define OTG2_HS_DEVICE_OTG_HS_DIEPINT7_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg2_hs_device_otg_hs_doepctl0 OTGHSDOEPCTL0 OTG_HS device control OUT endpoint 0 control register
@{*/

/** OTG2_HS_DEVICE_OTG_HS_DOEPCTL0_EPENA Endpoint enable **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL0_EPENA		(1 << 31)
/** OTG2_HS_DEVICE_OTG_HS_DOEPCTL0_EPDIS Endpoint disable **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL0_EPDIS		(1 << 30)
/** OTG2_HS_DEVICE_OTG_HS_DOEPCTL0_SNAK Set NAK **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL0_SNAK		(1 << 27)
/** OTG2_HS_DEVICE_OTG_HS_DOEPCTL0_CNAK Clear NAK **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL0_CNAK		(1 << 26)
/** OTG2_HS_DEVICE_OTG_HS_DOEPCTL0_Stall STALL handshake **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL0_Stall		(1 << 21)
/** OTG2_HS_DEVICE_OTG_HS_DOEPCTL0_SNPM Snoop mode **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL0_SNPM		(1 << 20)

#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL0_EPTYP_SHIFT		18
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL0_EPTYP_MASK		0x03
/** @defgroup otg2_hs_device_otg_hs_doepctl0_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG2_HS_DEVICE_OTG_HS_DOEPCTL0_NAKSTS NAK status **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL0_NAKSTS		(1 << 17)
/** OTG2_HS_DEVICE_OTG_HS_DOEPCTL0_USBAEP USB active endpoint **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL0_USBAEP		(1 << 15)

#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL0_MPSIZ_SHIFT		0
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL0_MPSIZ_MASK		0x03
/** @defgroup otg2_hs_device_otg_hs_doepctl0_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg2_hs_device_otg_hs_doepint0 OTGHSDOEPINT0 OTG_HS device endpoint-0 interrupt register
@{*/

/** OTG2_HS_DEVICE_OTG_HS_DOEPINT0_NYET NYET interrupt **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPINT0_NYET		(1 << 14)
/** OTG2_HS_DEVICE_OTG_HS_DOEPINT0_B2BSTUP Back-to-back SETUP packets received **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPINT0_B2BSTUP		(1 << 6)
/** OTG2_HS_DEVICE_OTG_HS_DOEPINT0_OTEPDIS OUT token received when endpoint disabled **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPINT0_OTEPDIS		(1 << 4)
/** OTG2_HS_DEVICE_OTG_HS_DOEPINT0_STUP SETUP phase done **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPINT0_STUP		(1 << 3)
/** OTG2_HS_DEVICE_OTG_HS_DOEPINT0_EPDISD Endpoint disabled interrupt **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPINT0_EPDISD		(1 << 1)
/** OTG2_HS_DEVICE_OTG_HS_DOEPINT0_XFRC Transfer completed interrupt **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPINT0_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg2_hs_device_otg_hs_doeptsiz0 OTGHSDOEPTSIZ0 OTG_HS device endpoint-0 transfer size register
@{*/


#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ0_STUPCNT_SHIFT		29
#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ0_STUPCNT_MASK		0x03
/** @defgroup otg2_hs_device_otg_hs_doeptsiz0_stupcnt STUPCNT SETUP packet count
@{*/
/**@}*/

