grevaillot/svd_tools/headers/STM32H750x/otg2_hs_device.h
/** @defgroup otg2_hs_device_otg_hs_doeptsiz2 OTGHSDOEPTSIZ2 OTG_HS device endpoint-2 transfer size register
@{*/


#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ2_RXDPID_STUPCNT_SHIFT		29
#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ2_RXDPID_STUPCNT_MASK		0x03
/** @defgroup otg2_hs_device_otg_hs_doeptsiz2_rxdpid_stupcnt RXDPIDSTUPCNT Received data PID/SETUP packet count
@{*/
/**@}*/


#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ2_PKTCNT_SHIFT		19
#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ2_PKTCNT_MASK		0x3ff
/** @defgroup otg2_hs_device_otg_hs_doeptsiz2_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ2_XFRSIZ_SHIFT		0
#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ2_XFRSIZ_MASK		0x7ffff
/** @defgroup otg2_hs_device_otg_hs_doeptsiz2_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg2_hs_device_otg_hs_doepctl3 OTGHSDOEPCTL3 OTG device endpoint-3 control register
@{*/

/** OTG2_HS_DEVICE_OTG_HS_DOEPCTL3_EPENA Endpoint enable **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL3_EPENA		(1 << 31)
/** OTG2_HS_DEVICE_OTG_HS_DOEPCTL3_EPDIS Endpoint disable **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL3_EPDIS		(1 << 30)
/** OTG2_HS_DEVICE_OTG_HS_DOEPCTL3_SODDFRM Set odd frame **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL3_SODDFRM		(1 << 29)
/** OTG2_HS_DEVICE_OTG_HS_DOEPCTL3_SD0PID_SEVNFRM Set DATA0 PID/Set even frame **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL3_SD0PID_SEVNFRM		(1 << 28)
/** OTG2_HS_DEVICE_OTG_HS_DOEPCTL3_SNAK Set NAK **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL3_SNAK		(1 << 27)
/** OTG2_HS_DEVICE_OTG_HS_DOEPCTL3_CNAK Clear NAK **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL3_CNAK		(1 << 26)
/** OTG2_HS_DEVICE_OTG_HS_DOEPCTL3_Stall STALL handshake **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL3_Stall		(1 << 21)
/** OTG2_HS_DEVICE_OTG_HS_DOEPCTL3_SNPM Snoop mode **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL3_SNPM		(1 << 20)

#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL3_EPTYP_SHIFT		18
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL3_EPTYP_MASK		0x03
/** @defgroup otg2_hs_device_otg_hs_doepctl3_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG2_HS_DEVICE_OTG_HS_DOEPCTL3_NAKSTS NAK status **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL3_NAKSTS		(1 << 17)
/** OTG2_HS_DEVICE_OTG_HS_DOEPCTL3_EONUM_DPID Even odd frame/Endpoint data PID **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL3_EONUM_DPID		(1 << 16)
/** OTG2_HS_DEVICE_OTG_HS_DOEPCTL3_USBAEP USB active endpoint **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL3_USBAEP		(1 << 15)

#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL3_MPSIZ_SHIFT		0
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL3_MPSIZ_MASK		0x7ff
/** @defgroup otg2_hs_device_otg_hs_doepctl3_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg2_hs_device_otg_hs_doepint3 OTGHSDOEPINT3 OTG_HS device endpoint-3 interrupt register
@{*/

/** OTG2_HS_DEVICE_OTG_HS_DOEPINT3_NYET NYET interrupt **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPINT3_NYET		(1 << 14)
/** OTG2_HS_DEVICE_OTG_HS_DOEPINT3_B2BSTUP Back-to-back SETUP packets received **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPINT3_B2BSTUP		(1 << 6)
/** OTG2_HS_DEVICE_OTG_HS_DOEPINT3_OTEPDIS OUT token received when endpoint disabled **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPINT3_OTEPDIS		(1 << 4)
/** OTG2_HS_DEVICE_OTG_HS_DOEPINT3_STUP SETUP phase done **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPINT3_STUP		(1 << 3)
/** OTG2_HS_DEVICE_OTG_HS_DOEPINT3_EPDISD Endpoint disabled interrupt **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPINT3_EPDISD		(1 << 1)
/** OTG2_HS_DEVICE_OTG_HS_DOEPINT3_XFRC Transfer completed interrupt **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPINT3_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg2_hs_device_otg_hs_doeptsiz3 OTGHSDOEPTSIZ3 OTG_HS device endpoint-3 transfer size register
@{*/


#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ3_RXDPID_STUPCNT_SHIFT		29
#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ3_RXDPID_STUPCNT_MASK		0x03
/** @defgroup otg2_hs_device_otg_hs_doeptsiz3_rxdpid_stupcnt RXDPIDSTUPCNT Received data PID/SETUP packet count
@{*/
/**@}*/


#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ3_PKTCNT_SHIFT		19
#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ3_PKTCNT_MASK		0x3ff
/** @defgroup otg2_hs_device_otg_hs_doeptsiz3_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ3_XFRSIZ_SHIFT		0
#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ3_XFRSIZ_MASK		0x7ffff
/** @defgroup otg2_hs_device_otg_hs_doeptsiz3_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg2_hs_device_otg_hs_doepctl4 OTGHSDOEPCTL4 OTG device endpoint-4 control register
@{*/

/** OTG2_HS_DEVICE_OTG_HS_DOEPCTL4_EPENA Endpoint enable **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL4_EPENA		(1 << 31)
/** OTG2_HS_DEVICE_OTG_HS_DOEPCTL4_EPDIS Endpoint disable **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL4_EPDIS		(1 << 30)
/** OTG2_HS_DEVICE_OTG_HS_DOEPCTL4_SODDFRM Set odd frame **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL4_SODDFRM		(1 << 29)
/** OTG2_HS_DEVICE_OTG_HS_DOEPCTL4_SD0PID_SEVNFRM Set DATA0 PID/Set even frame **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL4_SD0PID_SEVNFRM		(1 << 28)
/** OTG2_HS_DEVICE_OTG_HS_DOEPCTL4_SNAK Set NAK **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL4_SNAK		(1 << 27)
/** OTG2_HS_DEVICE_OTG_HS_DOEPCTL4_CNAK Clear NAK **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL4_CNAK		(1 << 26)
/** OTG2_HS_DEVICE_OTG_HS_DOEPCTL4_Stall STALL handshake **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL4_Stall		(1 << 21)
/** OTG2_HS_DEVICE_OTG_HS_DOEPCTL4_SNPM Snoop mode **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL4_SNPM		(1 << 20)

#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL4_EPTYP_SHIFT		18
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL4_EPTYP_MASK		0x03
/** @defgroup otg2_hs_device_otg_hs_doepctl4_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG2_HS_DEVICE_OTG_HS_DOEPCTL4_NAKSTS NAK status **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL4_NAKSTS		(1 << 17)
/** OTG2_HS_DEVICE_OTG_HS_DOEPCTL4_EONUM_DPID Even odd frame/Endpoint data PID **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL4_EONUM_DPID		(1 << 16)
/** OTG2_HS_DEVICE_OTG_HS_DOEPCTL4_USBAEP USB active endpoint **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL4_USBAEP		(1 << 15)

#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL4_MPSIZ_SHIFT		0
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL4_MPSIZ_MASK		0x7ff
/** @defgroup otg2_hs_device_otg_hs_doepctl4_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg2_hs_device_otg_hs_doepint4 OTGHSDOEPINT4 OTG_HS device endpoint-4 interrupt register
@{*/

/** OTG2_HS_DEVICE_OTG_HS_DOEPINT4_NYET NYET interrupt **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPINT4_NYET		(1 << 14)
/** OTG2_HS_DEVICE_OTG_HS_DOEPINT4_B2BSTUP Back-to-back SETUP packets received **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPINT4_B2BSTUP		(1 << 6)
/** OTG2_HS_DEVICE_OTG_HS_DOEPINT4_OTEPDIS OUT token received when endpoint disabled **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPINT4_OTEPDIS		(1 << 4)
/** OTG2_HS_DEVICE_OTG_HS_DOEPINT4_STUP SETUP phase done **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPINT4_STUP		(1 << 3)
/** OTG2_HS_DEVICE_OTG_HS_DOEPINT4_EPDISD Endpoint disabled interrupt **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPINT4_EPDISD		(1 << 1)
/** OTG2_HS_DEVICE_OTG_HS_DOEPINT4_XFRC Transfer completed interrupt **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPINT4_XFRC		(1 << 0)

/**@}*/

