grevaillot/svd_tools/headers/STM32H750x/otg2_hs_device.h
#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ6_PKTCNT_SHIFT		19
#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ6_PKTCNT_MASK		0x3ff
/** @defgroup otg2_hs_device_otg_hs_doeptsiz6_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ6_XFRSIZ_SHIFT		0
#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ6_XFRSIZ_MASK		0x7ffff
/** @defgroup otg2_hs_device_otg_hs_doeptsiz6_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg2_hs_device_otg_hs_doepctl7 OTGHSDOEPCTL7 OTG device endpoint-7 control register
@{*/

/** OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_EPENA Endpoint enable **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_EPENA		(1 << 31)
/** OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_EPDIS Endpoint disable **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_EPDIS		(1 << 30)
/** OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_SODDFRM Set odd frame **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_SODDFRM		(1 << 29)
/** OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_SD0PID_SEVNFRM Set DATA0 PID/Set even frame **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_SD0PID_SEVNFRM		(1 << 28)
/** OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_SNAK Set NAK **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_SNAK		(1 << 27)
/** OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_CNAK Clear NAK **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_CNAK		(1 << 26)
/** OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_Stall STALL handshake **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_Stall		(1 << 21)
/** OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_SNPM Snoop mode **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_SNPM		(1 << 20)

#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_EPTYP_SHIFT		18
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_EPTYP_MASK		0x03
/** @defgroup otg2_hs_device_otg_hs_doepctl7_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_NAKSTS NAK status **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_NAKSTS		(1 << 17)
/** OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_EONUM_DPID Even odd frame/Endpoint data PID **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_EONUM_DPID		(1 << 16)
/** OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_USBAEP USB active endpoint **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_USBAEP		(1 << 15)

#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_MPSIZ_SHIFT		0
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_MPSIZ_MASK		0x7ff
/** @defgroup otg2_hs_device_otg_hs_doepctl7_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg2_hs_device_otg_hs_doepint7 OTGHSDOEPINT7 OTG_HS device endpoint-7 interrupt register
@{*/

/** OTG2_HS_DEVICE_OTG_HS_DOEPINT7_NYET NYET interrupt **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPINT7_NYET		(1 << 14)
/** OTG2_HS_DEVICE_OTG_HS_DOEPINT7_B2BSTUP Back-to-back SETUP packets received **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPINT7_B2BSTUP		(1 << 6)
/** OTG2_HS_DEVICE_OTG_HS_DOEPINT7_OTEPDIS OUT token received when endpoint disabled **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPINT7_OTEPDIS		(1 << 4)
/** OTG2_HS_DEVICE_OTG_HS_DOEPINT7_STUP SETUP phase done **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPINT7_STUP		(1 << 3)
/** OTG2_HS_DEVICE_OTG_HS_DOEPINT7_EPDISD Endpoint disabled interrupt **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPINT7_EPDISD		(1 << 1)
/** OTG2_HS_DEVICE_OTG_HS_DOEPINT7_XFRC Transfer completed interrupt **/
#define OTG2_HS_DEVICE_OTG_HS_DOEPINT7_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg2_hs_device_otg_hs_doeptsiz7 OTGHSDOEPTSIZ7 OTG_HS device endpoint-7 transfer size register
@{*/


#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ7_RXDPID_STUPCNT_SHIFT		29
#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ7_RXDPID_STUPCNT_MASK		0x03
/** @defgroup otg2_hs_device_otg_hs_doeptsiz7_rxdpid_stupcnt RXDPIDSTUPCNT Received data PID/SETUP packet count
@{*/
/**@}*/


#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ7_PKTCNT_SHIFT		19
#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ7_PKTCNT_MASK		0x3ff
/** @defgroup otg2_hs_device_otg_hs_doeptsiz7_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ7_XFRSIZ_SHIFT		0
#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ7_XFRSIZ_MASK		0x7ffff
/** @defgroup otg2_hs_device_otg_hs_doeptsiz7_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/
